W6/D3/first_routes/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" INNER JOIN "artwork_shares" ON "artwork_shares"."artwork_id" = "artworks"."id" WHERE (artist_id = '1' OR viewer_id = '1')
---
  def index
    if params.has_key?(:user_id) #/users/user_id/artworks
      @artworks =
        Artwork
          .joins(:artwork_shares)
          .where('artist_id = ? OR viewer_id = ?', params[:user_id], params[:user_id])
    else
      @artworks = Artwork.all

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 4]]
---
  def destroy
    artwork = Artwork.find(params[:id])
    artwork.delete

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "artworks" SET "image_url" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["image_url", "sn.co"], ["updated_at", "2021-10-07 17:09:54.986917"], ["id", 4]]
---
  def update
    artwork = Artwork.find(params[:id])
    if artwork.update(artwork_params)