W6/D3/first_routes/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("viewer_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["viewer_id", 1], ["artwork_id", 2], ["created_at", "2021-10-07 18:55:22.483388"], ["updated_at", "2021-10-07 18:55:22.483388"]]
---
  def create
    artwork_share = ArtworkShare.new(artwork_shares_params)
    if artwork_share.save

SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 4]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 3]]
---
  def destroy
    artwork_share = ArtworkShare.find(params[:id])
    artwork_share.delete