W6/D3/first_routes/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE (user_id = '3' OR artwork_id = '2')
---
  def index
    if params.has_key?(:comment)
    comments = Comment
      .where('user_id = ? OR artwork_id = ?', params[:comment][:user_id], params[:comment][:artwork_id])
    else
      comments = Comment.all

INSERT INTO "comments" ("body", "user_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "This suxxxxx"], ["user_id", 1], ["artwork_id", 2], ["created_at", "2021-10-07 21:34:50.606668"], ["updated_at", "2021-10-07 21:34:50.606668"]]
---
  def create
    comment = Comment.new(comments_params)
    if comment.save