W7/D3/goal_app/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save #runs user.save. If true, then:
---
INSERT INTO "users" ("username", "created_at", "updated_at", "password_digest", "session_token") VALUES ($1, $2, $3, $4, $5) RETURNING "id"