W7/D2/music_app/app/views/bands/show.html.erb

<h3>Albums:</h3>
<%@band.albums.each do |album|%>
---
SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 1]]