W7/D2/music_app/app/models/user.rb

  def reset_session_token!
    self.session_token = SecureRandom::urlsafe_base64
    self.save!
---
UPDATE "users" SET "updated_at" = $1, "session_token" = $2 WHERE "users"."id" = $3  [["updated_at", "2021-10-12 20:47:27.270936"], ["session_token", "gr2z_BLvrg1UMy310MClPQ"], ["id", 9]]