W7/D5/RedditClone/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["username", "adrian123"], ["password_digest", "$2a$12$SmyVYtjOt0k3fdspYDMo1OOsCMdjeLAW7FPvRMslGFCR5pWqaTmii"], ["updated_at", "2021-10-15 23:15:10.742941"], ["id", 2]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)