W7/D3/goal_app/app/models/user.rb

UPDATE "users" SET "updated_at" = $1, "session_token" = $2 WHERE "users"."id" = $3  [["updated_at", "2021-10-13 22:24:03.997655"], ["session_token", "mrDEgdAUUG6p_X8FngxgHw"], ["id", 1]]
---
    def reset_session_token!
      self.session_token = SecureRandom::urlsafe_base64
      self.save!