W7/D2/music_app/app/controllers/albums_controller.rb

  def new
    @band = Band.find_by(id: params[:band_id])
    @bands = Band.all
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "bands".* FROM "bands"

  def create
    @album = Album.new(album_params)
    if @album.save
---
INSERT INTO "albums" ("title", "year", "live", "band_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Audioslave"], ["year", 2021], ["live", true], ["band_id", 1], ["created_at", "2021-10-12 23:50:39.636601"], ["updated_at", "2021-10-12 23:50:39.636601"]]