W7/D2/music_app/app/controllers/sessions_controller.rb

  def create
    @current_user = User.find_by(:session_token = session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" IS NULL LIMIT $1  [["LIMIT", 1]]

  def destroy
    @current_user.reset_session_token!
    @current_user.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "zpgLON4Q2iMmZXC1sCtfzA"], ["updated_at", "2021-10-12 21:09:08.261232"], ["id", 9]]